posts/ringtones-from-gba-roms.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project notes: getting playable audio files out of a .gba rom</title>
<meta name="author" content="josiah" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/my-dark.css"/>

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="../index.html">home</a>
<a href="../posts/articles.html">essays</a>
<a href="../personal/articles.html">diary</a>
<a href="../projects.html">projects</a>
<a href="../resume.pdf">resume</a>
<a href="../lore.html">lore</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Project notes: getting playable audio files out of a .gba rom</h1>
</header><p>
I want to have, say, a ring tone from megaman battle network 3 blue, somehow. I don’t know what i want exactly, but something from that game. I own the game 8 times over, surely there's a way to do this.
</p>

<div id="outline-container-orgf4e9e94" class="outline-2">
<h2 id="orgf4e9e94">Outline</h2>
<div class="outline-text-2" id="text-orgf4e9e94">
<ol class="org-ol">
<li>How do I get the files from the .gba file itself?
<ol class="org-ol">
<li>This is apparently annoying and lossy, but <code>vgmtrans</code> ~works.</li>
<li>I was suggested several other options but they require manually editing makefiles and compiling c++, gross, lets skip those.</li>
</ol></li>
<li><code>VGMtrans</code> is pretty self explantory, poke around the UI to find the files you want. You’ll have to play every sound collection in there to know what they are though.</li>
<li>Export all your files in various formats to your file system, again, just in the UI.</li>
<li>Next, a digression into how the resultant audio files work:
<ol class="org-ol">
<li><code>.MID</code> files are midi files, which contain music <i>sequences</i> but no <i>sound</i>.</li>
<li><code>DLS</code> is a “downloadable sounds” file, which contains sound samples that can be used by MIDI</li>
<li><code>SF2</code> is a soundfount file, basically an alternative to DLS.</li>
<li>Probably you only need either DLS or SF2 at a single time, just depends on what’s supported by the DAW you’ll be working with in next step</li>
</ol></li>
<li>Now you have all the bare files exported, but you need to recombine them into a file that your phone can understand.
<ol class="org-ol">
<li><code>LMMS</code> is free / open source. There’s better options, but not without a price tag.</li>
<li><code>LMMS</code> works, I did an original POC with it, but its not easily automatable. But! There is something that IS automatiable on the commandline called  <code>fluidsynth</code>  that gets us alllllmost all the way there - it can give us <code>.wav</code> files.</li>
<li>Once you have a <code>.wav</code> its easy to use ffmpeg to get <code>.mp3</code></li>
</ol></li>
</ol>
</div>
</div>


<div id="outline-container-org7153b10" class="outline-2">
<h2 id="org7153b10">Conversion script</h2>
<div class="outline-text-2" id="text-org7153b10">
<p>
I llm’d a script to do this for me en masse:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #598249;">import</span> os
<span style="color: #598249;">import</span> subprocess
<span style="color: #598249;">import</span> pdb

<span style="color: #5e6263;"># </span><span style="color: #5e6263;">Directory where your files are located</span>
<span style="color: #2F7BDE;">root</span> = <span style="color: #15968D;">"/Users/josiah/mmbn3/"</span>
<span style="color: #2F7BDE;">export_dir</span> = root + <span style="color: #15968D;">"exports"</span>
<span style="color: #2F7BDE;">directory</span> = root + <span style="color: #15968D;">"raws"</span>

<span style="color: #5e6263;"># </span><span style="color: #5e6263;">Go through each MIDI file and find its matching SF2 file</span>
<span style="color: #598249;">for</span> <span style="color: #598249;">file</span> <span style="color: #598249;">in</span> os.listdir(directory):
    <span style="color: #598249;">if</span> <span style="color: #598249;">file</span>.endswith(<span style="color: #15968D;">".mid"</span>):
        <span style="color: #2F7BDE;">midi_file</span> = os.path.join(directory, <span style="color: #598249;">file</span>)
        <span style="color: #2F7BDE;">sf2_file</span> = os.path.join(directory, <span style="color: #598249;">file</span>.replace(<span style="color: #15968D;">".mid"</span>, <span style="color: #15968D;">".sf2"</span>))

        <span style="color: #598249;">if</span> os.path.exists(sf2_file):
            <span style="color: #5e6263;"># </span><span style="color: #5e6263;">Output WAV file name</span>
            <span style="color: #2F7BDE;">output_wav</span> = os.path.join(export_dir, <span style="color: #598249;">file</span>.replace(<span style="color: #15968D;">".mid"</span>, <span style="color: #15968D;">".wav"</span>))
            <span style="color: #2F7BDE;">output_mp3</span> = os.path.join(export_dir, <span style="color: #598249;">file</span>.replace(<span style="color: #15968D;">".mid"</span>, <span style="color: #15968D;">".mp3"</span>))

            <span style="color: #5e6263;"># </span><span style="color: #5e6263;">Run Fluidsynth to combine the files and export to WAV</span>
            subprocess.run([
                <span style="color: #15968D;">"fluidsynth"</span>, <span style="color: #15968D;">"-ni"</span>, sf2_file, midi_file, <span style="color: #15968D;">"-F"</span>, output_wav
            ])
            subprocess.run([
                <span style="color: #15968D;">"ffmpeg"</span>, <span style="color: #15968D;">"-i"</span>, output_wav, output_mp3
            ])

            <span style="color: #5e6263;"># </span><span style="color: #5e6263;">Delete the WAV file after MP3 is successfully created</span>
            <span style="color: #598249;">if</span> os.path.exists(output_mp3):
                os.remove(output_wav)
                <span style="color: #598249;">print</span>(f<span style="color: #15968D;">"Deleted intermediate file: </span>{output_wav}<span style="color: #15968D;">"</span>)
            <span style="color: #598249;">print</span>(f<span style="color: #15968D;">"Processed </span>{<span style="color: #598249;">file</span>}<span style="color: #15968D;"> -&gt; </span>{output_mp3}<span style="color: #15968D;">"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org5dfd1f3" class="outline-2">
<h2 id="org5dfd1f3">iphone idiocy</h2>
<div class="outline-text-2" id="text-org5dfd1f3">
<p>
You’d think you’d be done, simply import them to your phone and bam you got ring tones!
</p>

<p>
Wrong.
</p>

<p>
On iPhone, for historic “we sell ringtones” reasons, its still very annoying to get a sound file to be recognized by the system as appropriate for ring tone useage. 
</p>

<ol class="org-ol">
<li>Put your files on icloud drive somewhere</li>
<li>Open garageband on your phone</li>
<li>Create a new project with the <code>audio recorder</code> option</li>
<li>Import your audio file
<ol class="org-ol">
<li>Tap the <code>loop</code> icon in the top right</li>
<li>Go to the weird loop thing on the top right</li>
<li><code>browse items from the files app</code></li>
</ol></li>
<li>Trim audio as needed</li>
<li>Tap the <code>down arrow</code> in the top left, select “my songs” and then select from storage, import the specific file.
<ol class="org-ol">
<li>Tap on the song song you’ve just created</li>
<li>The select share</li>
<li>Choose ringtone.</li>
</ol></li>
<li>Now assign as default ringtone in settings, or per contact</li>
</ol>
</div>
</div>

<div id="outline-container-orgd232535" class="outline-2">
<h2 id="orgd232535">Problems with this approach</h2>
<div class="outline-text-2" id="text-orgd232535">
<p>
This has worked mostly well! But there's a few things that are sub-optimal that i haven't figured out:
</p>
<ol class="org-ol">
<li>There's definitely some sound effects I can't find. Probably that's weirdness in the import process to vgmtrans, but no idea what i can do about it</li>
<li>Despite exporting the sf2 files, the sounds are just a bit off when it comes to the soundtrack - the midi file / sequence definitely works, but the instruments must be subtly different. 
<ol class="org-ol">
<li>I'm tempted to try remixing all the files with DLS instead of sf2 and see if it changes the output, but i'm out of time today :|</li>
</ol></li>
<li>I haven't figured out a bulletproof way to have notifications on iPhone setup the way i want
<ol class="org-ol">
<li>Apple watches mess with your notification scheme, both individually per app and globally with the <code>silent</code> option.</li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p></p>
</div>
</body>
</html>